/// @file     command.c
/// @date     2019.07.10
/// @author   PSM
/// @brief    시리얼통신 Command 처리 file
#define COMMAND_C
#include "include/_include.h"

//=========================================================================
//	MACRO 정의
//=========================================================================
#define SERIADR(ram)			(U8 *)(&(ram))		// 82 CMD DATA TABLE용

#define Z_nestMax				(3)						//	네스팅 최대치
#define Z_rammax				(0xFEDF)				/*	RAM 영역 최대 ADDRESS 			*/
#define Z_rammin				(0xDF00)				/*	RAM 영역 최소 ADDRESS(sfr까지 포함)*/
#define Z_50bytemax				(32)					//	50/51 CMD 송신 BYTE 상한치

//=========================================================================
//	함수 ProtType 선언
//=========================================================================
static U8 CommandCheck(CMD_PARA *selcmd, U8 bufno);
//	COMMAND CHECK
static U8 CommandF6(void);							//	RAM 읽기
static U8 CommandF7(void);							//	RAM 쓰기 1
static U8 CommandF8(void);							//	RAM 쓰기 2
static U8 CommandF9(void);							//	MICOM 식별 CODE 읽기
static U8 Command50(void);							//	RAM 고속 읽기 설정
static U8 Command51(void);							//	RAM 고속 읽기
static U8 Command80(void);							//	TEST MODE 이행
static U8 Command8F(void);							//	전부하 OFF
static void TestAllOff(void);							//	전부하 OFF
static U8 Command91(void);							//	91 COMMAND 검색
static U8 Command9140(void);							//	부저출력
static U8 Command9160(void);							//	Tx Pin 출력
static U8 Command91B0(void);							//	Display검사
static U8 Command91B1(void);							//	Display검사
static U8 Command91B2(void);							//	Display검사
static U8 CommandB2(void);							//	B2 COMMAND 검색
static U8 CommandB220(void);							//	ROM Check 확인
static U8 CommandEnd(void);							//	해당 COMMAND 없음

//=========================================================================
//	외부 STARTING 변수
//=========================================================================
static U8 C_nest;									//	재귀횟수
static U8 D_F7data;								//	F7 COMMAND 쓰기 DATA
static U8 D_50byte;								//	50/51 COMMAND 송신 BYTE수
static U8 *B_50adr[Z_50bytemax];	//	50/51 COMMAND 송신 DATA ADDRESS BUFFER (POINTER)
static U8 B_50data[Z_50bytemax];				//	50/51 COMMAND 송신 DATA BUFFER

//=========================================================================
//	TABLE DATA
//=========================================================================
const CMD_PARA cmd1data[] =
{				//	CMD1 검색 TABLE
		{ 0xF6, 7, CommandF6 },					//		RAM 읽기
				{ 0xF7, 7, CommandF7 },					//		RAM 쓰기 1
				{ 0xF8, 7, CommandF8 },					//		RAM 쓰기 2
				{ 0xF9, 1, CommandF9 },					//		MICOM 식별 CODE 읽기
				{ 0x50, 9, Command50 },					//		일괄 RAM 읽기 설정
				{ 0x51, 1, Command51 },					//		일괄 RAM 읽기
				{ 0x80, 1, Command80 },					//		TEST MODE 이행
				{ 0x8F, 1, Command8F },				//		TEST MODE : 전부하 OFF
				{ 0x91, 0, Command91 },					//		부하구동
				{ 0xB2, 0, CommandB2 },					//		ROM Check
				{ Z_endcode, 0, CommandEnd },				//		반드시 최후에 만들 것
		};//

const CMD_PARA cmd2data55[] =
{				//	55 COMMAND CMD2 검색 TABLE
		{ Z_endcode, 0, CommandEnd },				//		반드시 최후에 만들 것
		};//

const CMD_PARA cmd2data91[] =
{				//	91 COMMAND CMD2 검색 TABLE
		{ 0x40, 2, Command9140 },					//		부저출력
				{ 0x60, 2, Command9160 },					//		Tx Pin 출력
				{ 0xB0, 2, Command91B0 },					//		Display검사1
				{ 0xB1, 2, Command91B1 },					//		Display검사2
				{ 0xB2, 2, Command91B2 },					//		Display검사3
				{ Z_endcode, 0, CommandEnd },				//		반드시 최후에 만들 것
		};//
//

const CMD_PARA cmd2dataB2[] =
{             //	B2 COMMAND -- TABLE
		{ 0x20, 2, CommandB220 },					//		ROM CHECK 판정
				{ Z_endcode, 0, CommandEnd },          	//		반드시 최후에 만들 것
		};//

void Command_Initialize(void)
{

}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL COMMAND 분석
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 (COMMAND 실행 있음-이상종료)
 1 (COMMAND 실행 있음-정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
U8 Command(void)									//
{														//
	U8 ret = 0;									//	초기치[0:이상종료]
	//---------------------------------					//
	if (F_TestMode_PBA == SET)
	{ /*	TEST MODE인 경우 		*/
		gu8_TimerTestMode = ZT_TestMode; /*		serial command 미수신 timer set */
	}													//
	C_nest = 0x00;										//	재귀횟수 초기 CLR
	ret = CommandCheck(cmd1data, 1);						//	CMD1 CHECK
	if ((ret == 1) && (gu8_BufferSerData[1] == 0xF7))
	{			//	정상 and F7 CMD 수신인 경우
		f_F7cmd = 1;								//		F7 CMD 수신 FLAG SET
	}													//
	else
	{												//	이상 or F7 CMD 수신이외의 경우
		f_F7cmd = 0;								//		F7 CMD 수신 FLAG CLR
	}													//
	return (ret);										//	반환값 SET
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL COMMAND CHECK
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 (이상종료)
 1 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandCheck(CMD_PARA *selcmd, U8 bufno)
{														//
	//----------------------------------				//
	C_nest++;
	if (C_nest > Z_nestMax)
	{							//	재귀이상의 경우
		return (0);										//		반환값=0 (이상종료)
	}													//
														//
	for (; selcmd->name != Z_endcode ; selcmd++)
	{ /*	for loop (대응 CMD 검색)*/
		if (selcmd->name == gu8_BufferSerData[bufno])
		{ /*		대응 CMD 있는 경우*/
			if ((selcmd->cmdsize == 0) || (selcmd->cmdsize == gu8_CMDMany - 1))
			{
				//			CMD수 정상인 경우
				return ((selcmd->exeadr)());		//				반환값=CMD실행결과
			}
			else
			{									//			CMD수 이상인 경우
				return (0);							//				반환값=0 (이상종료)
			}											//
		}												//
	}													//
	return (0);											//	반환값=0 (이상종료)
}														//

/*""FUNC COMMENT""***********************************************************
 * 합수  개요 :  표준 SERIAL 수신 COMMAND 검색 종료
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 (이상종료)
 1 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandEnd(void)							//
{														//
	//---------------------------------					//
	return (0);										//	반환값=[0:CMD실행없음(이상종료)]
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [F6]
 *----------------------------------------------------------------------------
 * 기      능 :  RAM 읽기
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandF6(void)								//
{														//
	//---------------------------------					//
	if (DisAsciiByte(&gu8_BufferSerData[6], &gu8_DataMany) == 0)
	{	//	ASCII CODE 역변환(읽기DATA수) 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
	if (gu8_DataMany == 0x00)
	{							//	읽기 DATA수 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
	if (DisAsciiWord(&gu8_BufferSerData[2], &gu16_access.adr) == 0)
	{
		//	ASCII CODE 역변환(읽기개시RAM ADDRESS:2BYTE) 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
	if (((gu16_access.adr + (U16) gu8_DataMany - 1) > Z_rammax)
			|| (gu16_access.adr < Z_rammin))
	{
		//	읽기 RAM ADDRESS 이상(영역 외)인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
														//
	return (1);									//	반환값=[1:COMMAND실행있음(정상종료)]
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [F7]
 *----------------------------------------------------------------------------
 * 기      능 :		RAM 쓰기1
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandF7(void)								//
{														//
	//---------------------------------					//
	if (DisAsciiWord(&gu8_BufferSerData[2], &gu16_access.adr) == 0)
	{

		return (0);
	}													//
	if ((gu16_access.adr > Z_rammax) || (gu16_access.adr < Z_rammin))
	{

		return (0);
	}													//
	if (DisAsciiByte(&gu8_BufferSerData[6], &D_F7data) == 0)
	{
		return (0);
	}													//
														//
	gu8_DataMany = 0;
	return (1);
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [F8]
 *----------------------------------------------------------------------------
 * 기      능 :		RAM 쓰기2
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandF8(void)								//
{														//
	U16 f8address;									//
	U8 f8data;										//
	//---------------------------------					//
	if (f_F7cmd == 0)
	{
		return (0);
	}

	if (DisAsciiWord(&gu8_BufferSerData[2], &f8address) == 0)
	{
		return (0);
	}
	if (f8address != gu16_access.adr)
	{
		return (0);
	}

	if (DisAsciiByte(&gu8_BufferSerData[6], &f8data) == 0)
	{
		return (0);
	}
	if (f8data != D_F7data)
	{
		return (0);
	}

	*gu16_access.pnt = D_F7data;
	gu8_DataMany = 0;
	return (1);
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [F9]
 *----------------------------------------------------------------------------
 * 기      능 :		식별코드 읽기
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandF9(void)								//
{														//
	//---------------------------------					//
	gu8_BufferSerData[6] = gu8_RomNum[0];
	gu8_BufferSerData[7] = gu8_RomNum[1];
	gu8_BufferSerData[8] = gu8_RomNum[2];
	gu8_BufferSerData[9] = gu8_RomNum[3];
	gu16_access.pnt = &gu8_BufferSerData[6];
	gu8_DataMany = 4;
	return (1);
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [50]
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command50(void)								//
{														//
	U8 ret = 0;								//	반환값 초기치=[0:COMMAND실행없음(이상종료)]
	U8 i;											//
	U8 numvalue;										//
	U16 address;									//
	U8 position;									//
	//---------------------------------					//
	if (DisAsciiByte(&gu8_BufferSerData[8], &numvalue) == 0)
	{		//	ASCII CODE 역변환(송신BYTE수) 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
	if ((numvalue == 0) || (numvalue > Z_50bytemax))
	{				//	송신BYTE수 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
														//
	D_50byte = numvalue;								//	50/51 CMD 송신 BYTE수
	gu8_DataMany = D_50byte;	//	[DATA1~DATAn]송신DATA바이트수:1바이트=ASCII DATA 2회 송신
	//
	if (DisAsciiWord(&gu8_BufferSerData[2], &address) == 0)
	{	//	ASCII CODE 역변환(읽기RAM ADDRESS:2Byte) 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
	gu16_addr.adr = address;								//	읽기 RAM ADDRESS
	if ((gu16_addr.adr > Z_rammax) || (gu16_addr.adr < Z_rammin))
	{
		//	읽기 RAM ADDRESS 이상(RAM영역외)인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
														//
	if (DisAsciiByte(&gu8_BufferSerData[6], &position) == 0)
	{    //	ASCII CODE 역변환(송신 위치) 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
	if ((position > D_50byte) || (position == 0))
	{		//	송신위치 이상인 경우
		return (0);							//		반환값=[0:COMMAND실행없음(이상종료)]
	}													//
	if (f_50cmd == 0)
	{									//	초회 수신시인 경우
		f_50cmd = 1;								//		50 CMD 수신 FLAG SET
		for (i = 0 ; i < Z_50bytemax ; i++)
		{				//		ADDRESS 초기치 설정
			B_50adr[i] = (U8*) Z_rammin;	//			USER RAM  선두 ADDRESS로 설정
		}												//
	}													//
	B_50adr[position - 1] = gu16_addr.pnt;					//	송신 DATA ADDRESS
	ret = Command51();									//	송신 DATA 설정
	return (ret);										//	반환값 SET
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [51]
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command51(void)								//
{														//
	U8 ret = 0;								//	반환값 초기치=[0:COMMAND실행없음(이상종료)]
	U8 i;											//
	//---------------------------------					//
	if (f_50cmd == 1)
	{									//	50 CMD 수신 경험 있는 경우
		ret = 1;							//		반환값=[1:COMMAND실행있음(정상종료)]
		gu16_access.pnt = &B_50data[0];					//		읽기 ADDRESS
		gu8_DataMany = D_50byte;	//		[DATA1~DATAn]송신DATA바이트수:1바이트=ASCII DATA 2회 송신
		for (i = 0 ; i < D_50byte ; i++)
		{					//		for loop (송신 BYTE 횟수)
			B_50data[i] = *B_50adr[i];	//			지정ADDRESS DATA 송신BUFFER 격납
		}												//
	}													//
														//
	return (ret);										//	반환값 SET
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [80]
 *----------------------------------------------------------------------------
 * 기      능 :  TEST MODE 이행 COMMAND
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command80(void)								//
{														//
	U8 ret = 0;								//	반환값 초기치=[0:COMMAND실행없음(이상종료)]
	//---------------------------------					//
	if ((F_TestMode_PBA != SET) && (gu8_TimerPBATest_Join != 0))
	{		//	TEST MODE 이외 and 이행허가시간(30초) 미경과인 경우
		ret = 1;							//		반환값=[1:COMMAND실행있음(정상종료)]
//		F_Test = SET;									//		TEST MODE 이행 FLAG SET
		TestAllOff();									//		전부하 OFF
		gu8_DataMany = 0;	//		[DATA1~DATAn]송신DATA바이트수:1바이트=ASCII DATA 2회 송신
	}													//
														//
	return (ret);										//	반환값 SET
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [8F]
 *----------------------------------------------------------------------------
 * 기      능 :  TEST MODE - 전부하 OFF 실행
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command8F(void)								//
{														//
	U8 ret = 0;								//	반환값 초기치=[0:COMMAND실행없음(이상종료)]
	//---------------------------------					//
	if (F_TestMode_PBA == SET)
	{								//	TEST MODE인 경우
		ret = 1;							//		반환값=[1:COMMAND실행있음(정상종료)]
		TestAllOff();									//		전부하 OFF
		gu8_DataMany = 0;	//		[DATA1~DATAn]송신DATA바이트수:1바이트=ASCII DATA 2회 송신
	}													//
														//
	return (ret);										//	반환값 SET
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  전부하 OFF
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  -
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void TestAllOff(void)							//
{														//
	//---------------------------------					//
	F_TestOutput[0].byte = 0;							//	검사 출력 지시 0 clr
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [91**]
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command91(void)								//
{														//
	U8 ret = 0;							//	반환값 초기치=[0:COMMAND실행없음(이상종료)]
	//---------------------------------					//
	if (F_TestMode_PBA == SET)
	{								//	TEST MODE인 경우
		if (CommandCheck(cmd2data91, 2) == 1)
		{               //		CMD CHECK OK인 경우
			ret = 1;					//			반환값=[1:COMMAND실행있음(정상종료)]
			gu8_DataMany = 0;		//			[DATA1~DATAn]송신BYTE수(2회 송신에 1개)
		}												//
	}													//
														//
	return (ret);										//	반환값 SET
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [9140]
 *----------------------------------------------------------------------------
 * 기      능 :  TEST MODE COMMAND (부저 출력 ON)
 ;				-
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = 이상종료
 1 = 정상종료
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command9140(void)							//
{														//
	U8 ret;										//	반환값 초기치=[0:이상종료]
	//---------------------------------					//
//	f_BuzzerOutput = 1;									//
//
//	TDR02 = 124;								//		500kHz / 4000Hz = 125, 빼기 1해야함,	부저 Spec.중 가장 dB가 높은 주파수
//	s_Buzzer = 1;								//		부저 ON
//	D_buzzer = 0;								//		번호 clr
//	TOE0 = TOE0 | 0x0004;						//		부저펄스 Enable
//	TO0 &= 0x0004U;								//		Output register on
//	TS0 = TS0 | 0x0004;							//		부저펄스 Start

	ret = 1;											//		반환값=[1:정상종료]
														//
	return (ret);										//	반환값 SET
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [9160]
 *----------------------------------------------------------------------------
 * 기      능 :  TEST MODE COMMAND (Tx Pin 출력 ON)
 ;				-
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = 이상종료
 1 = 정상종료
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command9160(void)							//
{														//
	U8 ret;										//	반환값 초기치=[0:이상종료]
	//---------------------------------					//
	f_TxPinTest = 1;									//

	ret = 1;											//		반환값=[1:정상종료]
														//
	return (ret);										//	반환값 SET
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [9140]
 *----------------------------------------------------------------------------
 * 기      능 :  TEST MODE COMMAND (부저 출력 ON)
 ;				-
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = 이상종료
 1 = 정상종료
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command91B0(void)							//
{
	U8 ret;										//	반환값 초기치=[0:이상종료]
	//---------------------------------					//
	f_DisplayTest1 = 1;									//
	f_DisplayTest2 = 0;									//
	f_DisplayTest3 = 0;									//
	gu8_TimerDisplayTest = 0;
	gu8_CounterDisplayTest = 0;

	ret = 1;											//		반환값=[1:정상종료]
														//
	return (ret);										//	반환값 SET
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [9140]
 *----------------------------------------------------------------------------
 * 기      능 :  TEST MODE COMMAND (부저 출력 ON)
 ;				-
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = 이상종료
 1 = 정상종료
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command91B1(void)							//
{
	U8 ret;										//	반환값 초기치=[0:이상종료]
	//---------------------------------					//
	f_DisplayTest2 = 1;									//
	f_DisplayTest1 = 0;									//
	f_DisplayTest3 = 0;									//
	gu8_TimerDisplayTest = 0;
	gu8_CounterDisplayTest = 0;

	ret = 1;											//		반환값=[1:정상종료]
														//
	return (ret);										//	반환값 SET
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [9140]
 *----------------------------------------------------------------------------
 * 기      능 :  TEST MODE COMMAND (부저 출력 ON)
 ;				-
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = 이상종료
 1 = 정상종료
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 Command91B2(void)							//
{
	U8 ret;										//	반환값 초기치=[0:이상종료]
	//---------------------------------					//
	f_DisplayTest3 = 1;									//
	f_DisplayTest2 = 0;									//
	f_DisplayTest1 = 0;									//
	gu8_TimerDisplayTest = 0;
	gu8_CounterDisplayTest = 0;

	ret = 1;											//		반환값=[1:정상종료]
														//
	return (ret);										//	반환값 SET
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [91**]
 *----------------------------------------------------------------------------
 * 기      능 :  -
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = COMMAND 실행 없음 (이상종료)
 1 = COMMAND 실행 있음 (정상종료)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandB2(void)								//
{														//
	U8 ret = 0;								//	반환값 초기치=[0:COMMAND실행없음(이상종료)]
	//---------------------------------					//
	if (F_TestMode_PBA == SET)
	{							//	TEST MODE인 경우
		if (CommandCheck(cmd2dataB2, 2) == 1)
		{         //		CMD CHECK OK인 경우
			ret = 1;					//			반환값=[1:COMMAND실행있음(정상종료)]
		}												//
	}													//
														//
	return (ret);										//	반환값 SET
}														//

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :  표준 SERIAL 통신 [B220]
 *----------------------------------------------------------------------------
 * 기      능 :  ROM CHECK 결과 판정
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  0 = 이상종료
 1 = 정상종료
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 CommandB220(void)							//
{														//
	//---------------------------------					//
//	D_access.pnt = &D_RomCheck;							//	ROM CHECK 판정치
	gu8_DataMany = 1;			//	[DATA1~DATAn]송신BYTE수:1Byte=ASCII DATA 2회 송신
	return (1);											//	반환값=[1:정상종료]
}
