/// @file     serial.c
/// @date     2019.07.10
/// @author   PSM
/// @brief    Serial UART통신 동작 제어 file
//#pragma	interrupt	INTSR0		R_SAU0_CH0_Int

#define SERIAL_C
#include "include/_include.h"


/*=======================================================================*/
/*		MACRO 정의														 */
/*=======================================================================*/
#define SERIAL_IN()			(RXD1)				/*	SERIAL 통신 수신 BUFFER	*/
#define SERIAL_OUT(dt)		{					\
								TXD1 = (dt);	\
							}					/*	SERIAL 송신 			*/

#define SERIAL_SFRRFS()		{						/*	송수신금지 및 SFR REFRESH	*/\
								ST0 = 0X0003;				\
								SRMK0 = 1;					\
								SRIF0 = 0;					\
								SMR00 = 0x0022U;			\
								SCR00 = 0x8097U;			\
								SMR01 = 0x0122U;			\
								SCR01 = 0x4097U;			\
							}

#define SERIAL_RX0EN()		{								\
								SRIF0 = 0;					\
								SRMK0 = 0;					\
								SetIORBit(SS0, 0x0002);		\
							}

#define SERIAL_TX0EN()		{								\
								STIF0 = 0;					\
							    /*STMK0 = 0;*/				\
								SetIORBit(SOE0, 0x0001);	\
							    SetIORBit(SS0, 0x0001);		\
							}

#define ZT_serTrNo				(20)				/*	SERIAL 송신 금지 TIME			<20ms/1ms> 	*/
#define ZT_serTrIntvl			(3)					/*	SERIAL CHARACTER 송신 간격 TIME	<3ms/1ms> 	*/
#define ZT_serCmuSts			(50)				/*	SERIAL 통신 상태 계속 TIME		<5s/100ms> 	*/

#define	Z_STXcode		(0x02U)				/*	[STX] CODE				*/
#define	Z_ETXcode		(0x03U)				/*	[ETX] CODE				*/
#define Z_CRcode		(0x0dU)				/*	[CR] CODE				*/

#define ZT_serialBana	(50)				//	<500ms/10ms>

/*=======================================================================*/
/*	STARTING 함수 ProtType 선언											 */
/*=======================================================================*/
static void IniSerial(void); /*	초기화 처리 		*/
static void SerStdRecieve(void); /*	표준 수신 			*/
static void Go_StdRecieve(void); /*	표준 수신 이행 처리 */
static void SerStdTransmit(void); /*	표준 송신 			*/
static void Go_StdTransmit(void); /*	표준 송신 이행 처리 */
static U8 RecDataCheck(void); /*	수신 DATA CHECK 	*/
static void SerTxRxControl(void); /*	SERIAL 송수신 관리 	*/
static U8 RecdataRead(void); /*	수신 DATA 읽어 내기 */
static void SerReceive(U8 recdata); /*	통상 수신 			*/
static void SerRcvWait(void); /*	수신 대기 			*/
static void SerTraWait(void); /*	송신 대기 			*/
static void SerTransmit(void); /*	송신 처리 			*/
static U8 DataReadyCheck(void); /*	DATA 준비 CHECK 	*/
static void TransDataSet(void); /*	송신 DATA SET 		*/
static void TraDataWrite(U8 data); /*	송신 버퍼에 쓰기 	*/
static U16 SerTra_STXCMD(void); /*	송신 : STX,CMD 		*/
static U16 SerTra_DATA(void); /*	송신 : DATA 		*/
static U16 SerTra_ETX(void); /*	송신 : ETX 			*/
static U16 SerTra_SUM(void); /*	송신 : SUM 			*/
static U16 SerTra_CR(void); /*	송신 : CR 			*/

static void TraDataStore(U8 *pmoto, U8 *psaki, U8 size);

/*=======================================================================*/
/*	STARTING 변수 선언														 */
/*=======================================================================*/

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	표준 serial 통신 초기 설정
 *----------------------------------------------------------------------------
 * 기      능 :	UART1 관련 SFR 초기 set
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
void Serial_Initialize(void)
{

}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	serial 수신 INTERRUPT
 *----------------------------------------------------------------------------
 * 기      능 :	수신 data check
 송수신 mode check
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
void R_Serial_Interrupt(void)
{
	U8 recdata;
	/****************************************************/
	recdata = RecdataRead(); /*	수신data의 읽기*/

	if ((gu8_SerControl & 0xf0) != 0x20)
	{ /*	수신 이외인 경우*/
		return; /*		DATA 파기*/
	}

	switch (recdata)
	{ /*	switch (수신data)*/
		case Z_STXcode: /*	[STX:0x02]인 경우*/
			gu8_CounterSerData = 0; /*		serial 통신 counter clr*/
			break;
		case 0x00:
		case 0xff: /*	dead code인 경우*/
			return; /*		data 파기*/
//		break;
		default: /*	상기이외*/
			break;
	}

	if (gu8_SerControl > 0x26)
	{ /*	상태가 없는 경우*/
		SafetyLoop(); /*		Safety Loop*/
	}
	SerReceive(recdata); /*	통상 수신*/
	/*	*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	수신 data의 취득
 *----------------------------------------------------------------------------
 * 기      능 :	수신 data의 read
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	U8 work (수신 data)
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 RecdataRead(void)
{
	U16 work;
	U8 work1;
	/****************************************************/
	work = SERIAL_IN(); /*	수신data의 취득*/
	work1 = (U8) (work & 0x00ffU);
	return (work1); /*	반환값=[수신data]*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	통상 data의 수신
 *----------------------------------------------------------------------------
 * 기      능 :	수신 data를 STX부터 차례대로 buffer에 저장
 CR 수신시 송수신대기로 천이
 *----------------------------------------------------------------------------
 * 인      수 :	U8 recdata (수신 DATA)
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	수신 interrupt에서 호출
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void SerReceive(U8 recdata) /*	통상 수신*/
{
	/****************************************************/
	if (gu8_CounterSerData >= Z_recbufmax)
	{ /*	수신buffer data의 수가 over인 경우*/
		return; /*		data 파기*/
	}

	gu8_BufferSerData[gu8_CounterSerData] = recdata; /*	수신data의 격납*/
	if ((recdata == Z_CRcode) && (gu8_BufferSerData[0] == Z_STXcode))
	{
		/*	금회CR수신 and 첫번째수신buffer가 STX인 경우*/
		gu8_TimerSerTrNo = ZT_serTrNo; /*		serial 송신금지 timer set*/
		gu8_SerControl = 0x00; /*		상태천이 -> 송수신대기*/
	} else
	{ /*	기타인 경우*/
		gu8_CounterSerData++; /*		serial 통신 counter 1 증가*/
	}
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	serial 통신 상태 천이 관리
 *----------------------------------------------------------------------------
 * 기      능 :	serial 통신 상태를 관리한다.(초기->수신->송신)
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	MAIN에서 1주기마다 처리
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
void SerialControl(void) /*	표준 SERIAL 통신 : 통신 상태 천이 처리*/
{
	static const struct void_func DT_Serial[] = {
			{ 0x00, IniSerial }, /*		초기*/
			{ 0x10, SerStdRecieve }, /*		표준 수신*/
			{ 0x11, SerStdTransmit }, /*		표준 송신*/
			{ 0xFF, SafetyLoop }, /*		Safety Loop*/
	};
	U8 i;
	/****************************************************/
//	CopyRemoconFlagClear();								/*	serial(모의리모콘) 관련 flags clr*/
	for (i = 0; DT_Serial[i].num != gu8_Serial; i++)
	{ /*	상태가 발견될때까지 Loop*/
		if (DT_Serial[i].num == 0xFF)
		{ /*		끝까지 발견되지 않는 경우*/
			SafetyLoop(); /*			무한 LOOP*/
		}
	}
	DT_Serial[i].exeadr(); /*	대응하는 함수 실행*/

	SerTxRxControl(); /*	송수신 관리*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	통신 상태 천이 [00 : 초기 설정]
 *----------------------------------------------------------------------------
 * 기      능 :	표준수신 처리로 이행
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void IniSerial(void) /*	초기 설정*/
{
	/****************************************************/
	Go_StdRecieve(); /*	표준 수신 이행 처리*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	통신 상태 천이 [10 : 표준 수신]
 *----------------------------------------------------------------------------
 * 기      능 :	수신완료를 check
 - 수신data check와 command check가 ok인 경우 송신 대기로 이행
 - 상기의 check가 ng인 경우 수신 대기로 이행
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void SerStdRecieve(void) /*	표준 수신*/
{
	/****************************************************/
	if (gu8_SerControl == 0x00)
	{ /*	수신완료인 경우*/
		if (RecDataCheck() == 1)
		{ /*		수신data check가 OK인 경우*/
			if (Command() == 1)
			{ /*			각 command 처리가 정상인 경우*/
				Go_StdTransmit(); /*				송신 대기 초기 설정*/
			} else
			{ /*			command 처리가 이상인 경우*/
				Go_StdRecieve(); /*				수신 대기 초기 설정*/
			}
		} else
		{ /*		수신code가 이상인 경우*/
			Go_StdRecieve(); /*			수신 대기 초기 설정*/
		}
	}
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	통신 상태 천이 [10 : 표준 수신 이행 처리]
 *----------------------------------------------------------------------------
 * 기      능 :	수신 지시
 *----------------------------------------------------------------------------
 * 인      수 :  -
 *----------------------------------------------------------------------------
 * 반  환  값 :  -
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void Go_StdRecieve(void) /*	표준 수신 이행 처리*/
{
	/****************************************************/
	gu8_Serial = 0x10; /*	상태천이 -> 표준수신*/
	gu8_SerControl = 0x10; /*	수신지시*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	통신 상태 천이 [11 : 표준 송신]
 *----------------------------------------------------------------------------
 * 기      능 :	송신완료를 check
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void SerStdTransmit(void) /*	표준 송신*/
{
	/****************************************************/
	if (gu8_SerControl == 0x00)
	{ /*	송신 완료인 경우*/
		Go_StdRecieve(); /*		상태 천이 -> 표준 수신*/
	}
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	통신 상태 천이 [11 : 표준 송신 이행 처리]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 지시
 serial 통신 상태 계속 timer set
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void Go_StdTransmit(void) /*	표준송신이행처리*/
{
	/****************************************************/
	gu8_Serial = 0x11; /*	상태천이 -> 표준송신*/
	gu8_SerControl = 0x30; /*	송신지시*/
	gu8_TimerSerCmuSts = ZT_serCmuSts; /*	serial 통신 상태계속 timer set*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	수신 data check [표준 수신용]
 *----------------------------------------------------------------------------
 * 기      능 :	ETX check
 SUM check
 STX ~ CMDn의 data수 check
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	0:이상, 1:정상
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 RecDataCheck(void) /*	수신 data check*/
{
	U8 sum1 = 0;
	U8 sum2;
	U8 i;
	/****************************************************/
	for (i = 1; i < (Z_recbufmax-1); i++)
	{ /*	for 루프(수신data 버퍼분)*/
		sum1 += gu8_BufferSerData[i]; /*		checksum치 가산*/
		if (gu8_BufferSerData[i] == Z_ETXcode)
		{ /*		[ETX] data인 경우*/
			gu8_CMDMany = i; /*			[STX~CMD3] 송신data수 set*/
			if (DisAsciiByte(&gu8_BufferSerData[i + 1], &sum2) == 1)
			{
				/*		ASCII역변환(checksum치) 정상인 경우*/
				if (sum1 == sum2)
				{ /*				checksum치 정상인 경우*/
					return (1); /*					수신 data 정상*/
				}
			}
			return (0); /*			수신 data 이상*/
		}
	}
	return (0); /*	[ETX] 미수신 (수신 data 이상)*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송수신 관리
 *----------------------------------------------------------------------------
 * 기      능 :	송수신 상태를 각각 관리한다.
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void SerTxRxControl(void) /*	송수신 관리*/
{
	/****************************************************/
	switch (gu8_SerControl & 0xf0)
	{ /*	switch(송수신 상태)*/
		case 0x00: /*	대기인 경우*/
			break;
		case 0x10: /*	수신대기인 경우*/
			SerRcvWait(); /*		[10 수신대기]*/
			break;
		case 0x20: /*	수신(MAIN처리는 없음)인 경우*/
			break;
		case 0x30: /*	송신대기인 경우*/
			SerTraWait(); /*		[30 송신대기]*/
			break;
		case 0x40: /*	송신인 경우*/
			SerTransmit(); /*		[40 송신처리]*/
			break;
		default: /*	상기 이외인 경우*/
			break;
	}
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송수신 관리 [10 : 수신 대기]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 간격 timer를 check하여 신규 수신 data를 기다린다.
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void SerRcvWait(void) /*	수신 대기*/
{
	/****************************************************/
	if (gu8_TimerSerTrIntvl == 0)
	{ /*	Character 간격 timer up인 경우*/
//		SERIAL_SFRRFS(); /*		송수신금지 & SFR REFRESH*/
		R_UART1_Create();
		gu8_CounterSerData = 0; /*		Serial 송수신 counter clr*/
		gu8_SerControl = 0x20; /*		상태천이 -> 표준수신*/
//		SERIAL_RX0EN(); /*		수신허가 송신금지*/
		R_UART1_Start();
	}
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송수신 관리 [30 : 송신 대기]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 금지 timer를 check
 - 송신data 준비 check하여 송신
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void SerTraWait(void) /*	송신 대기*/
{
	/****************************************************/
	if (gu8_TimerSerTrNo == 0)
	{ /*	송신 금지 timer up인 경우*/
//		SERIAL_SFRRFS()
		R_UART1_Create(); /*		송신금지 & SFR REFRESH*/
		if (DataReadyCheck() == 1)
		{ /*		DATA준비check ok인 경우*/
			gu8_CounterSerData = 0; /*			serial 송수신 counter clear*/
			gu8_BufferChecksum = 0x00;
			gu8_SerControl = 0x40; /*			상태천이 -> 송신*/
			SERIAL_TX0EN(); /*			송신허가 & 수신금지*/
			R_UART1_Start();
		}
		else
		{ /*		DATA준비check NG인 경우*/
			if (gu8_TimerSerCmuSts == 0)
			{ /*			송신대기시간(5s) 경과한 경우*/
				gu8_SerControl = 0x00; /*				상태천이 -> 송수신대기 (송신cancel)*/
			}
		}
	}
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송수신 관리 [40 : 송신 처리]
 *----------------------------------------------------------------------------
 * 기      능 :	character 간격 timer up check하여 송신data set
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void SerTransmit(void) /*	송신 처리*/
{
	/****************************************************/
	if ((SSR00 & 0x07) == 0)
	{ /*	error가 없는 경우*/
		if (gu8_TimerSerTrIntvl == 0)
		{ /*		serial character 간격 timer up인 경우*/
			TransDataSet(); /*			serial 송신 data set*/
			gu8_TimerSerTrIntvl = ZT_serTrIntvl; /*			serial character 간격 timer set*/
		}
	}
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	40 : 송신 처리 [송신 data set]
 *----------------------------------------------------------------------------
 * 기      능 :	각 송신 상태에 따른 data의 설정
 - STX ~ CR
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void TransDataSet(void) /*	송신 data set*/
{
	U8 tradata;
	/****************************************************/
	switch (gu8_SerControl)
	{ /*	switch (serial 송수신 상태)*/
		case 0x40: /*	[STX~CMD3]인 경우*/
			tradata = (U8) SerTra_STXCMD(); /*		[STX~CMD3] 송신 DATA*/
			gu8_BufferChecksum += tradata; /*		CHECKSUM 가산*/
			break;
		case 0x41: /*	[DATA1~DATAn]인 경우*/
			tradata = (U8) SerTra_DATA(); /*		[DATA1~DATAn] 송신 DATA*/
			gu8_BufferChecksum += tradata; /*		CHECKSUM 가산*/
			break;
		case 0x42: /*	[ETX]인 경우*/
			tradata = (U8) SerTra_ETX(); /*		[ETX] 송신 DATA*/
			gu8_BufferChecksum += tradata; /*		CHECKSUM 가산*/
			gu8_BufferChecksum = (U8) (gu8_BufferChecksum - Z_STXcode);     //			CHECKSUM 산출 버퍼 초기화([STX]분 감하여둔다)
			break;
		case 0x43: /*	[SUM1,SUM2]인 경우*/
			tradata = (U8) SerTra_SUM(); /*		[SUM1,SUM2] 송신 DATA*/
			break;
		case 0x44: /*	[CR]인 경우*/
			tradata = (U8) SerTra_CR(); /*		[CR] 송신 DATA*/
			break;
		default: /*	상기이외의 경우*/
			return; /*		return*/
			break;
	}


	TraDataWrite((U8) tradata); /*	송신 레지스터에 data write*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송신 data의 set [송신 register write]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 buffer에 data를 write
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void TraDataWrite(U8 data)
{
	/****************************************************/
	SERIAL_OUT(data); /*	Serial 송신*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송신 data의 set [STX ~ CMDn]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 buffer에 STX~CMDn의 data를 write
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	U8 data (송신data:STX~CMDn)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U16 SerTra_STXCMD(void) /*	송신 처리 (STX ~ CMDn)*/
{
	U16 data;
	/****************************************************/
	data = gu8_BufferSerData[gu8_CounterSerData]; /*	수신 buffer data*/
	gu8_CounterSerData++;
	if (gu8_CounterSerData >= gu8_CMDMany)
	{ /*	지정data수 송신 종료한 경우*/
		if (gu8_DataMany == 0)
		{ /*		[DATA1~DATAn] 송신 필요없는 경우*/
			gu8_SerControl = 0x42; /*			serial송수신상태 -> 송신:[ETX]*/
		} else
		{ /*		[DATA1~DATAn] 송신 필요있는 경우*/
			gu8_SerControl = 0x41; /*			serial송수신상태 -> 송신:[DATA1~DATAn]*/
			TraDataStore(gu16_access.pnt, &gu8_DataNum[0], gu8_DataMany);
			/*			송신 DATA 임시 저장*/
			F_ascii = Z_asciihi; /*			상위부터 송신*/
			gu8_CounterSerData = 0; /*			serial송신 counter clr*/
		}
	}

	return (data); /*	반환값=[송신data]*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송신 data의 set [DATA1 ~ DATAn]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 buffer에 DATA1~DATAn의 data를 write
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	U8 data (송신data:DATA1~DATAn)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U16 SerTra_DATA(void) /*	송신 처리 (DATA1 ~ DATAn)*/
{
	U16 data;
	/****************************************************/
	data = Ascii(gu8_DataNum[gu8_CounterSerData], F_ascii); /*	송신 data (ASCII 변환)*/
	if (F_ascii == Z_asciilo)
	{ /*	하위4BIT data 송신인 경우*/
		F_ascii = Z_asciihi; /*		다음 상위 송신*/
		gu8_CounterSerData++;
		if (gu8_CounterSerData >= gu8_DataMany)
		{ /*		지정data수 송신 종료한 경우*/
			gu8_SerControl = 0x42; /*			serial송수신상태 -> 송신:[ETX]*/
		}
	} else
	{ /*	상위 송신인 경우*/
		F_ascii = Z_asciilo; /*		다음 하위 송신*/
	}

	return (data); /*	반환값=[송신data]*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송신 data의 set [ETX]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 buffer에 ETX의 data를 write
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	U8 data (송신data:ETX)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U16 SerTra_ETX(void) /*	송신 처리 (ETX)*/
{
	/****************************************************/
	gu8_SerControl = 0x43; /*	serial송수신상태 => 송신:[SUM]*/
	F_ascii = Z_asciihi; /*	상위부터 송신*/
	return (Z_ETXcode); /*	반환값=[송신data]*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송신 data의 set [SUM]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 buffer에 SUM의 data를 write
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	U8 data (송신data:SUM)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U16 SerTra_SUM(void) /*	송신 처리 (SUM)*/
{
	U16 data;
	/****************************************************/
	data = Ascii(gu8_BufferChecksum, F_ascii); /*	송신 data (ASCII 변환)*/
	if (F_ascii == Z_asciihi)
	{ /*	상위 송신인 경우*/
		F_ascii = Z_asciilo; /*		다음 하위 송신*/
	} else
	{ /*	하위 송신인 경우*/
		gu8_SerControl = 0x44; /*		serial송수신상태 => 송신:[CR]*/
	}

	return (data); /*	반환값=[송신data]*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	송신 data의 set [CR]
 *----------------------------------------------------------------------------
 * 기      능 :	송신 buffer에 CR의 data를 write
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	U8 data (송신data:CR)
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U16 SerTra_CR(void) /*	송신 처리 (CR)*/
{
	/****************************************************/
	gu8_SerControl = 0x00; /*	serial송수신상태 => 송신:[송신종료]*/
	return (Z_CRcode); /*	반환값=[송신data]*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	30:송신 대기 [data 준비 check]
 *----------------------------------------------------------------------------
 * 기      능 :	F3 command, B1 command의 송신data 준비상황을 check
 *----------------------------------------------------------------------------
 * 인      수 :	-
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	0:미준비, 1:준비
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static U8 DataReadyCheck(void) /*	data ready check*/
{
	/****************************************************/
	switch (gu8_BufferSerData[1])
	{ /*	switch (CMD1)*/
		case 0xf3: /*	[F3] command의 경우*/
			if (gu8_R_eepSerial == 0x01)
			{ /*		EEPROM 읽기 = OK의 경우*/
				return (1); /*			송신 DATA 준비 완료*/
			} else if (gu8_R_eepSerial == 0x00)
			{ /*		EEPROM 읽기 = NG의 경우*/
				gu8_SerControl = 0x00; /*			송신 중지*/
			} else
			{
			}
			break;
		case 0xb1: /*	[B1] command의 경우*/
			if (gu8_B1cmdAns == 0)
			{ /*		ANSWER 이상 확정의 경우*/
				return (1); /*			송신data 준비 완료*/
			} else if ((gu8_R_eepSerial == 0x01) || (gu8_R_eepSerial == 0x00))
			{
				/*		EEPROM 처리 종료의 경우*/
				gu8_B1cmdAns = gu8_R_eepSerial; /*			ANSWER에 결과를 COPY*/
				return (1); /*			송신 DATA 준비 완료*/
			} else
			{
			} /*			송신data 준비 완료*/
			break;
		default: /*	송신 DATA 준비 대기 필요없는 커멘드의 경우*/
			return (1); /*		송신data 준비 완료*/
			break;
	}
	return (0); /*	송신data 준비 미완료*/
}

/*""FUNC COMMENT""***********************************************************
 * 함수  개요 :	data 전송
 *----------------------------------------------------------------------------
 * 기      능 :	data수분, 전송 원부터 전송 선으로 data를 전송
 *----------------------------------------------------------------------------
 * 인      수 :	U8 *pmoto (전송 선)
 U8 *psaki (전송 원)
 U8 size (DATA 수)
 *----------------------------------------------------------------------------
 * 반  환  값 :	-
 *----------------------------------------------------------------------------
 * 주의  사항 :	-
 *----------------------------------------------------------------------------
 *""FUNC COMMENT END""*******************************************************/
static void TraDataStore(U8 *pmoto, U8 *psaki, U8 size)
{
	/****************************************************/
	for (; size != 0; size--)
	{ /*	for Loop (data수)	  */
		*psaki = *pmoto; /*		DATA 전송		  */
		psaki++; /*		전송 선ADDRESS +1 */
		pmoto++; /*		전송 원ADDRESS +1 */
	}
}
