#ifdef FIX_RAM_C
	#define	EXTERN
	#define	GLOBAL_VARIABLE_DEFINE
#else
	#define	EXTERN extern
#endif

#pragma section @@DATA	@@FIX

//***************************************
//*              adc.c		            *
//***************************************


//***************************************
//*              display.c		        *
//***************************************
EXTERN U8 gu8_PWM_Count;							//	LED Duty 조절카운터

//***************************************
//*              input.c		        *
//***************************************

//***************************************
//*              keycontrol.c		    *
//***************************************


//***************************************
//*               macro.c		        *
//***************************************


//***************************************
//*               main.c                *
//***************************************


//***************************************
//*               operation.c           *
//***************************************
EXTERN U8 gu8_OperationStep;						//	운전상태
	#define gu8_OperationStep_hi	(gu8_OperationStep & 0xf0)
	#define gu8_OperationStep_lo	(gu8_OperationStep & 0x0f)

EXTERN U8 F_CommunicationCMD;


//***************************************
//*               safety.c              *
//***************************************

//***************************************
//*               timer.c               *
//***************************************


//***************************************
//*               테스트 용	            *
//***************************************
#ifdef _FOR_DEVELOP_
EXTERN U8 PSM1;
EXTERN U8 PSM2;
EXTERN U8 PSM3;
EXTERN U16 PSM4;
EXTERN U8 PSM5;
EXTERN U16 PSM6;
EXTERN U16 PSM7;

EXTERN I16 gi16_MCUSensor_Test;
#endif

#pragma section @@DATA	@@DATA


/*===========================================================================*/
#undef	EXTERN
#undef	GLOBAL_VARIABLE_DEFINE
/*===========================================================================*/
