/// @file   output.h
/// @date   2019.07.10
/// @author PSM
/// @brief  출력 처리 file

#ifdef OUTPUT_C
	#define 	EXTERN
	#define 	GLOBAL_VARIABLE_DEFINE
#else
	#define 	EXTERN extern
#endif

/*==============================================================================
 Timer Decrease
 ==============================================================================*/
#define	TDEC_1ms_OUTPUT()		{	/*	1ms 타이머 감산			*/	\
								}
#define	TDEC_10ms_OUTPUT()		{	/*	10ms 타이머 감산		*/	\
								}
#define	TDEC_100ms_OUTPUT()		{	/*	100ms 타이머 감산		*/	\
								}
#define	TDEC_1s_OUTPUT()		{	/*	1s 타이머 감산			*/	\
								}
#define	TDEC_10s_OUTPUT()		{	/*	10s 타이머 감산			*/	\
								}
#define	TDEC_1min_OUTPUT()		{	/*	1min 타이머 감산		*/	\
								}
#define	TDEC_10min_OUTPUT()		{	/*	10min 타이머 감산		*/	\
								}
#define	TDEC_1h_OUTPUT()		{	/*	1h 타이머 감산			*/	\
								}


/*==============================================================================
 Constant Definition
 ==============================================================================*/


/*==============================================================================
 Variable Definition
 ==============================================================================*/
EXTERN U8 gu8_UV_CMD;

/*==============================================================================
 function Definition
 ==============================================================================*/
void OutputControl(void);
void Output_Initialize(void);

//=============================================================================
#undef 	EXTERN
#undef 	GLOBAL_VARIABLE_DEFINE
//=============================================================================

