/// @file   main.h
/// @date   2019.07.10
/// @author PSM
/// @brief  메인루프 처리 관련 헤더 file

#ifdef MAIN_C
	#define 	EXTERN
	#define 	GLOBAL_VARIABLE_DEFINE
#else
	#define 	EXTERN extern
#endif

/*==============================================================================
 Timer Decrease
 ==============================================================================*/
#define	TDEC_1ms_MAIN()			{	/*	1ms 타이머 감산			*/	\
								}
#define	TDEC_10ms_MAIN()		{	/*	10ms 타이머 감산		*/	\
									TDEC(gu8_TimerHWWait);		\
								}
#define	TDEC_100ms_MAIN()		{	/*	100ms 타이머 감산		*/	\
								}
#define	TDEC_1s_MAIN()			{	/*	1s 타이머 감산			*/	\
									TDEC(gu32_Timer_Condensation);	\
									TDEC(gu8_TimerHeaterEndurance_Test);	\
									TDEC(gu8_TimerTestColdOff);	\
									TDEC(gu8_TimerTestColdOn);	\
								}
#define	TDEC_10s_MAIN()			{	/*	10s 타이머 감산			*/	\
								}
#define	TDEC_1min_MAIN()		{	/*	1min 타이머 감산		*/	\
									TDEC(gu8_TimerHeaterEndurance_Test_30min);	\
								}
#define	TDEC_10min_MAIN()		{	/*	10min 타이머 감산		*/	\
								}
#define	TDEC_1h_MAIN()			{	/*	1h 타이머 감산			*/	\
								}

/*==============================================================================
 Constant Definition
 ==============================================================================*/
// 프로그램 버전 표시
// 1) 첫번째 자리 : 	1 - 양산 적용
//                  0 - 양산 외
// 2) 두번째 자리 : 	1 - DPP
//                  2 - LPP
//					0 - 양산
// 3) 세번째 자리 : 		미정의
// 4) 네번째 자리 : 버전 표시
//                  0 ~ 16  (16이상이면 0 부터 재시작)
// #define PROGRAM_VERSION_NO      (0x0202)			//	아이콘 무빙 DPP	
// #define PROGRAM_VERSION_NO      (0x0202)			//	아이콘 무빙 LPP V0.2.0.2													
// #define PROGRAM_VERSION_NO      (0x0203)			//	아이콘 무빙 LPP V0.2.0.3
// #define PROGRAM_VERSION_NO      (0x0204)			//	아이콘 무빙 LPP V0.2.0.4
// #define PROGRAM_VERSION_NO      (0x0205)			//	아이콘 무빙 LPP V0.2.0.5
// #define PROGRAM_VERSION_NO      (0x02013)			//	아이콘 무빙 LPP V0.2.0.6
// #define PROGRAM_VERSION_NO      (0x1001)			//	아이콘3 양산 V1.0.0.1
// #define PROGRAM_VERSION_NO      (0x1002)			//	아이콘3 양산 V1.0.0.2
													// @001 파우셋 지속 감지 시, 필터 교체모드 계속 실행 되는 현상 수정
													// @002 히터 측정 계산식 변경
													// @003 전류 계산식 변경(방어코드 추가)
													// @004 스마트진단, 방어코드 추가유로파우셋 빠지면, 파우셋 무빙 auto는 동작 안하고 최상단에서 추출하도록 적용
													// @005 
													// @006 dc 전류 피드백 ad값 보정 삭제
// #define PROGRAM_VERSION_NO      (0x1003)			//아이콘3 양산 V1.0.0.3
// //   												// @007 모터 속도 변경(1.8초 -> 2.1초) - 최고경영자 지시사항
// 													// @008 서비스 플러싱 설명모드 개선(전체잠금 추가 / Wi-Fi 버튼 동작 수정 / 추출버튼 입력 시 플러싱 중지가 아니라 불가음 띄우도록 / 무빙파우셋 위치 설정 오류 수정)													
// #define PROGRAM_VERSION_NO      (0x1004)			//아이콘3 양산 V1.0.0.4
													// @009  파우셋 AUTO and 최상단 위치 시,연속추출(추출버튼 롱키)안되는 현상 수정
													// @010  [검사모드1] 추출 버튼 위치 시인성 강화 요청
													// @011  [검사모드2] 완료(FF00) 커맨드 수신 후 냉각팬 지속 동작
													// @012  [단축모드] 파우셋 검사 로직 변경 
											        //     기존 : 용량 선택 시 1회 파우셋 무빙 검사 진행
													//     변경 : 용량 선택 시 횟수 관계 없이 파우셋 무빙 검사 진행 (파우셋 불량 확인용)
													// @013 [단축모드] 모드 진입 조건 변경 (프론트 커버 미감지되도 진입되도록.) ------> 적용 X
                                                    //       -> 필터 커버 미감지되도 진입할수 있도록...
													// @014 자동화검사  FF00 수신 후, 추출버튼으로 파우셋 동작할수있도록 적용
													// @015 통신 먹통으로 메인 → 프론트 폴링 타이머 변경(40ms → 120ms)
													// @016 설치 냉수 플러싱 중, 전원 재인가 시 100% 표시되는 현상 수정

// #define PROGRAM_VERSION_NO      (0x1005)			//아이콘3 양산 V1.0.0.5
													// @017 데코파우셋 미감지 시, 일반모드 점멸 -> 추출시에만 점멸하도록 적용..(파우셋 LED)
													// @018 데코파우셋 이탈시, 온수 추출 가능 및 냉/정 이탈 음성 적용(무빙도 가능)
													// @019 데코파우셋 이탈 시, 추출버튼 입력하면 이전위치로 돌아간 후, 추출 시작하도록...(@018과 이어지는 내용)
													// @020 데코파우셋 이탈 시에도, 파우셋 위치 설정 가능하도록...
                                                    // @021 데코파우셋 이탈 -> 최상단 위치 -> 파우셋 위치 설정 시, Auto로 변경 
													// @022 -. 데코 파우셋 이탈 시, 냉/정 추출 : 음성 "파우셋 유로를 체결해주세요" 음성 및 디스플레이 표시 X
												    //      -. 데코 파우셋 이탈 시, 온수 추출: 온수 최초 1회 추출 시(첫잔 제외) "파우셋 유로를 체결해주세요" 음성 출력
												    //      -. 데코 파우셋 이탈 시, 온수 추출: 온수 최초 1회 추출 시(첫잔 제외) "파우셋 유로를 체결해주세요" 디스플레이 출력
													//      -.  => 1회 이후부터는...표시 및 음성 x
													// @023 검사모드 검출력 개선 : [단축 검사/검사모드1] 파우셋 동작 검사 시 컵감지 M/S 구속 여부 확인 기능 추가(미감지 -> 감지 -> 미감지)
													// @024 라인검사에서 냉/정 추출 할때, 자동종료가 아닌 추출버튼 재입력시 종료되도록 적용.
													// @025 데코파우셋 이탈상태에서 전원 부팅 시, 설정레벨이동 -> 데코파우셋 이탈 확인 후, 최상단으로 중복 이동 방지
													// @026 파우셋 설정 중, 데코파우셋 이탈 시, 모드 즉시 종료
													// @027 데코파우셋 이탈 and 1단계 설정일때, 물추출안됨. 수정
													// @028 파우셋 이탈 -> 체결 시, daycount reset
													// @029 데코파우셋 이탈 시, 스마트진단 90프로에서 종료안되는 현상 수정(안전사양)

// #define PROGRAM_VERSION_NO      (0x1006)			//아이콘3 양산 V1.0.0.6
// 													// @030 : 설정온도 90도 이상, 물끊김 개선
// 													// @031 : 메인라인 검사모드 / 단축검사모드에서 파우셋 계속 동작할 수 잇도록 적용(기존에는 1회 동작하고, 두번째 동작시 하강 후 안올라옴)													

#define PROGRAM_VERSION_NO      (0x1007)			//아이콘3 양산 V1.0.0.7
													// @032 : 출하 NG 건, 입수온도 20도 구간에서 히터와 출수온도에 따라 타겟온도 +1도 상향 적용
													// @033 : 음성 변경(배수호수 문구 삭제)
													// @034 : 유로파우셋 체결안됐을때, 온수 추출시 음성 변경
													// @035 : FOTA 완료 후에는 첫잔 안하도록 적용.
													// @036 : FOTA 완료 후, 히터 최대 WATT 백업 및 복원 기능 추가
													// @037 : FOTA 완료 후, 이전 추출 시에 스텝 값 백업 및 복원 기능 추가
													// @038 : FOTA 완료 후, 온수 학습값 유효성 확인 기능 추가
													// @039 : 냉수/온수/정수 추출량 증대
													// @040 : @033의 배수호수 음성 어드레스 원복
													// @041 : 85도 온수 추출 제어 변경(타겟온도 : -1도 / TDR값 : 3199로)
													// @042 : 파우셋 미체결 상태에서 온수 추출 시, 음성 기존 사용 하던 어드레스로 변경(264번지 - 1대1 교체로 함(FOTA 시, 음성 안나갈수도 있어서...))
													// @043 : 45도 / 85도 타겟온도 변경

//★★	FOTA할일 있으면 FOTA버전도 업데이트 해줘야함	★★//
//★★	버전 업데이트하면 설희석 차장님한테 말씀드리기	★★//

#define Z_TimerHWWait	(50)						//	하드웨어 안정화 대기 시간	<100ms/10ms>

/*==============================================================================
 Variable Definition
 ==============================================================================*/
EXTERN U8 gu8_TimerHWWait;							//	하드웨어 안정화 시간	<100ms/100ms>


/*==============================================================================
 function Definition
 ==============================================================================*/
void MainLoop(void);
void RamClear(void);


//=============================================================================
#undef 	EXTERN
#undef 	GLOBAL_VARIABLE_DEFINE
//=============================================================================
